In [2]:
import pandas as pd
case_4 = pd.read_csv("Documents/Data_Science/dataset_superstore_simple.csv")
case_4

,order_id,order_date,customer_id,segment,category,sub_category,sales,quantity,profit
0,CA-2016-152156,2016-11-08,CG-12520,Consumer,Furniture,Bookcases,261.9600,2,41.9136
1,CA-2016-152156,2016-11-08,CG-12520,Consumer,Furniture,Chairs,731.9400,3,219.5820
2,CA-2016-138688,2016-06-12,DV-13045,Corporate,Office Supplies,Labels,14.6200,2,6.8714
3,US-2015-108966,2015-10-11,SO-20335,Consumer,Furniture,Tables,957.5775,5,-383.0310
4,US-2015-108966,2015-10-11,SO-20335,Consumer,Office Supplies,Storage,22.3680,2,2.5164
...,...,...,...,...,...,...,...,...,...
9983,CA-2014-110422,2014-01-21,TB-21400,Consumer,Furniture,Furnishings,25.2480,3,4.1028
9984,CA-2017-121258,2017-02-26,DB-13060,Consumer,Furniture,Furnishings,91.9600,2,15.6332
9985,CA-2017-121258,2017-02-26,DB-13060,Consumer,Technology,Phones,258.5760,2,19.3932
9986,CA-2017-121258,2017-02-26,DB-13060,Consumer,Office Supplies,Paper,29.6000,4,13.3200
9987,CA-2017-119914,2017-05-04,CC-12220,Consumer,Office Supplies,Appliances,243.1600,2,72.9480

In [43]:
step1 = case_4.groupby(["customer_id"]).agg({"sales":"sum"})
step1

                sales
customer_id
AA-10315     5563.560
AA-10375     1056.390
AA-10480     1790.512
AA-10645     5086.935
AB-10015      886.156
...               ...
XP-21865     2374.658
YC-21895     5454.350
YS-21880     6720.444
ZC-21910     8025.707
ZD-21925     1493.944

[793 rows x 1 columns]

In [48]:
step2 = step1.loc[["JE-16165","KH-16510","AD-10180"],["sales"]].reset_index()
step2

  customer_id     sales
0    JE-16165  2697.248
1    KH-16510  5952.859
2    AD-10180  6106.880

In [52]:
result_No_4 = step2.iloc[2:]
result_No_4

  customer_id    sales
2    AD-10180  6106.88